resources/installer/src/Helpers/DBHelper.php

    public function updateAccountSettings(array $data) {
        $helper = new Helper();
        $helper->cache($data);
        $p_key = $helper->cache()['product_key'] ?? "";
        if($p_key == "") {
            cache()->driver('file')->forget($helper->cache_key);
            throw new Exception("Something went wrong! Purchase code registration failed! Please try again");
        }
        $admin = DB::table('admins')->first();
        if(!$admin) {
            DB::table('admins')->insert([
                'firstname'     => $data['f_name'],
                'lastname'      => $data['l_name'],
                'password'      => Hash::make($data['password']),
                'email'         => $data['email'],
            ]);
        }else {
            DB::table("admins")->where('id',$admin->id)->update([
                'firstname'     => $data['f_name'],
                'lastname'      => $data['l_name'],
                'password'      => Hash::make($data['password']),
                'email'         => $data['email'],
            ]);
---
select * from `admins` limit 1
update `admins` set `firstname` = 'jerry', `lastname` = 'jem', `password` = '$2y$10$MjcFsinyxTwmn2u9hNapbu0vGnjGaU41glSPkUBJnzbBZZml5R3xy', `email` = 'admin@gmail.com' where `id` = 1

        }
        if(Schema::hasTable('basic_settings')) {
            try{
                DB::table('basic_settings')->where('id',1)->update([
                    'site_name'     => $helper->cache()['app_name'] ?? "",
                ]);
---
update `basic_settings` set `site_name` = 'untedcare' where `id` = 1